/* 0) сформировать массив с помощью датчика случайных чисел;
1) удалить все элементы с чётными индексами;
2) добавить элемент с номером К
3) сдвинуть циклически на M элементов влево
4) поиск элемента равного среднему арифметическому элементов массива
5) сортировка, простое включение */
#include<iostream>
#include<cstdlib>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	cout << "0) Формировка массива с помощью датчика случайных чисел: " << endl;
	int i,n;
	int mas[100];
	cout<< "Введите количество чисел в массиве: ";
	cin>> n;
	for (int i = 0; i < n; i++)
	{
		mas[i] = rand() % 100 - 50;
		cout << " a[" << i << "] = " << mas[i] << endl;
	} // конец 0____________________________________________________________________________


	cout << "1) Удаление элементов с четными индексами: " << endl;
	int j = 0;
	int arr[10];
	for (int i = 1; i < n; i += 2)
	{
		arr[j] = mas[i];
		j++;
	}
	if (n % 2 == 0)
	{
		for (int j = 0; j < (n / 2); j++)
		{
			cout << " a[" << j << "] = " << arr[j] << endl;
		}
	}
	else if (n % 2 != 0)
	{
		for (int j = 1; j < (n / 2) + 1; j++)
		{
			cout << " a[" << j << "] = " << arr[j] << endl;
		}
	}
	// конец 1_______________________________________________________________________________


	cout << "2) Ввод элемента A c номером K: " << endl;
	int K, A;
	cout << "Введите значение A = ";
	cin >> A;
	cout << "Введите номер элемента A, K = ";
	cin >> K;
	for (int i = n; i > K; i--)
	{
		mas[i] = mas[i - 1];
	}
	n++;
	cout << "Массив с добавленным элементом К: " << endl;
	for (int i = 0; i < n; i++)
	{
		mas[K] = A;
		cout << " a[" << i << "] = " << mas[i] << endl;
	} // конец 2_____________________________________________________________________________


	cout << "3) Сдвинуть влево на М = ";
	int m,b;
	cin >> m;
	for (i = 0; i < m; ++i)
	{
		b = mas[0];
		for (j = 0; j < n - 1; j++) {
			mas[j] = mas[j + 1];
			mas[n - 1] = b;
		}
	}
	for (i = 0; i < n; ++i) {
		cout << " a["<<i<<"] = " << mas[i] << endl;
	}// конец 3______________________________________________________________________________
	

	cout << "4) Поиск элемента равного среднему арифмитическому всех элементов:"<<endl;
	int sum = 0, sr_zn = 0;
	for (int i = 0; i < n; i++)
	{
		sum += mas[i];
	}
	sr_zn = sum / n;
	cout<< "Среднее арифметичское = " <<sr_zn<< endl;
	for (int i = 0; i < n; i++)
	{
		if (sr_zn == mas[i])
		{
			cout<< "Найден элемент равный среднему арифметическому: " << " a[" << i << "] = " << mas[i] << endl;
			break;
		}
		else
		{
			cout << "a[i], равный среднему арифметическому, не найден!" << endl;;
			break;
		}
	}//конец 4_______________________________________________________________________________

	
	cout << "Сортировка простым включениеm:" << endl;
	for (int i = 1; i < n; i++)
	{
		int j = i - 1;
		while ((j >= 0) && (mas[i] > mas[j]))
		{
			j--;
		}
		j++;

		int x = mas[i];

		for (int t = i; t > j; t--)
			mas[t] = mas[t - 1];
		mas[j] = x;
	}
	for (int q = 0; q < n; q++)
	{
		cout << " a[" << q << "] = "<< mas[q] << endl;
	}

		return 0;
}