/* 0) ñôîðìèðîâàòü ìàññèâ ñ ïîìîùüþ äàò÷èêà ñëó÷àéíûõ ÷èñåë;
1) óäàëèòü âñå ýëåìåíòû ñ ÷¸òíûìè èíäåêñàìè;
2) äîáàâèòü ýëåìåíò ñ íîìåðîì Ê
3) ñäâèíóòü öèêëè÷åñêè íà M ýëåìåíòîâ âëåâî
4) ïîèñê ýëåìåíòà ðàâíîãî ñðåäíåìó àðèôìåòè÷åñêîìó ýëåìåíòîâ ìàññèâà
5) ñîðòèðîâêà, ïðîñòîå âêëþ÷åíèå */
#include<iostream>
#include<cstdlib>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	cout << "0) Ôîðìèðîâêà ìàññèâà ñ ïîìîùüþ äàò÷èêà ñëó÷àéíûõ ÷èñåë: " << endl;
	int i,n;
	int mas[100];
	cout<< "Ââåäèòå êîëè÷åñòâî ÷èñåë â ìàññèâå: ";
	cin>> n;
	for (int i = 0; i < n; i++)
	{
		mas[i] = rand() % 100 - 50;
		cout << " a[" << i << "] = " << mas[i] << endl;
	} // êîíåö 0____________________________________________________________________________


	cout << "1) Óäàëåíèå ýëåìåíòîâ ñ ÷åòíûìè èíäåêñàìè: " << endl;
	int j = 0;
	int arr[10];
	for (int i = 1; i < n; i += 2)
	{
		arr[j] = mas[i];
		j++;
	}
	if (n % 2 == 0)
	{
		for (int j = 0; j < (n / 2); j++)
		{
			cout << " a[" << j << "] = " << arr[j] << endl;
		}
	}
	else if (n % 2 != 0)
	{
		for (int j = 1; j < (n / 2) + 1; j++)
		{
			cout << " a[" << j << "] = " << arr[j] << endl;
		}
	}
	// êîíåö 1_______________________________________________________________________________


	cout << "2) Ââîä ýëåìåíòà A c íîìåðîì K: " << endl;
	int K, A;
	cout << "Ââåäèòå çíà÷åíèå A = ";
	cin >> A;
	cout << "Ââåäèòå íîìåð ýëåìåíòà A, K = ";
	cin >> K;
	for (int i = n; i > K; i--)
	{
		mas[i] = mas[i - 1];
	}
	n++;
	cout << "Ìàññèâ ñ äîáàâëåííûì ýëåìåíòîì Ê: " << endl;
	for (int i = 0; i < n; i++)
	{
		mas[K] = A;
		cout << " a[" << i << "] = " << mas[i] << endl;
	} // êîíåö 2_____________________________________________________________________________


	cout << "3) Ñäâèíóòü âëåâî íà Ì = ";
	int m,b;
	cin >> m;
	for (i = 0; i < m; ++i)
	{
		b = mas[0];
		for (j = 0; j < n - 1; j++) {
			mas[j] = mas[j + 1];
			mas[n - 1] = b;
		}
	}
	for (i = 0; i < n; ++i) {
		cout << " a["<<i<<"] = " << mas[i] << endl;
	}// êîíåö 3______________________________________________________________________________
	

	cout << "4) Ïîèñê ýëåìåíòà ðàâíîãî ñðåäíåìó àðèôìèòè÷åñêîìó âñåõ ýëåìåíòîâ:"<<endl;
	int sum = 0, sr_zn = 0;
	for (int i = 0; i < n; i++)
	{
		sum += mas[i];
	}
	sr_zn = sum / n;
	cout<< "Ñðåäíåå àðèôìåòè÷ñêîå = " <<sr_zn<< endl;
	for (int i = 0; i < n; i++)
	{
		if (sr_zn == mas[i])
		{
			cout<< "Íàéäåí ýëåìåíò ðàâíûé ñðåäíåìó àðèôìåòè÷åñêîìó: " << " a[" << i << "] = " << mas[i] << endl;
			break;
		}
		else
		{
			cout << "a[i], ðàâíûé ñðåäíåìó àðèôìåòè÷åñêîìó, íå íàéäåí!" << endl;;
			break;
		}
	}//êîíåö 4_______________________________________________________________________________

	
	cout << "Ñîðòèðîâêà ïðîñòûì âêëþ÷åíèåm:" << endl;
	for (int i = 1; i < n; i++)
	{
		int j = i - 1;
		while ((j >= 0) && (mas[i] > mas[j]))
		{
			j--;
		}
		j++;

		int x = mas[i];

		for (int t = i; t > j; t--)
			mas[t] = mas[t - 1];
		mas[j] = x;
	}
	for (int q = 0; q < n; q++)
	{
		cout << " a[" << q << "] = "<< mas[q] << endl;
	}

		return 0;
}
